{"archive_id": "8672d4e9aa62443baf9b1e99a18a3b11", "user_id": "dev-user", "patient_id": "7426599", "created_at": 1762796018.3937428, "updated_at": 1762796833.4319293, "state": {"transcript": " Hey Rashawn, it's good to hear your voice. Actually, I'd probably just double check. Can you share with me your? Date of birth. That's it.Would you mind? Let me know your date of birth and we're supposed to confirm our patients over. So awesome. Thank you very much.How are you? Yeah. Is this still a good time for you? The UMM? 9:30 Call. Hello. Uh, Mr. Hayes, can you still hear me? Oh. Great. OK, Yeah, I can hear you now. Uh, not sure. What's going on there? Umm, is this still a good time for you to do a? 2nd Oh great. What's been on your mind? What can I try to help with? Oh. Sure. Yeah, absolutely. Tell me a little bit more about that. What do you need? That's all. By the way, OK, so will male ibuprofen. Your back and then. Summarizing your the. History of your back issues that you've experienced. OK. Re remind me again about the. Tell me it again, I actually don't recall it. By the way, do you may, may I put you on speaker just so I can, uh. Type and record. All right. Thanks.Umm. The initial injury took place.In. 2003. Bob declined. There was an IED explosion on the. I was like Karen, I told the member to help treat. And that's the first time I hit my back. It was. He was treated by the the PA there and. You know I was since I was in medicine document which was my ignorance. But anyway, umm, meaning you would have you would have been the one to doc. Document yourself the right OK. To him, so he just treated me so there was no documentation. Grew down the engine. He's just, he's just like ears. Pain meds. Focus this X-ray blah blah blah. And that was kind of the gist of it. Gotcha. OK. And then when I uh, I started doing a. Annual labor job here and 2020. I want to say 2021 OK or when I first. See you about my back. That was the exacerbation of and I was picking up some. Umm, some beverages and Lotus Malta. I had to go to the following.Gotcha. OK umm. And then the rest of it is just to treat my father. How about you in the MRI talking with? Yeah, that sort of thing. Yeah. Umm.The uh. In the intervening years between your, you know that and. Initial, umm, can you tell me a little bit more about kind of what happened? During the event and then kind of the months and years after. Initially. Thank you for that.Run. Putting all my weight on my right leg. Kind of fire fireman's carry him and that's when I tweeted. Both dropped down to the floor and I just low crawled and drugged him to where I was taking it. So much after that was just like immediately. After that I went to the PA and said hey I can burn walk. My expectations that my expectations at the time was hopefully they were next to me home. Have been passing.Took the X-ray. He said he saw.Uh, the injury. But he couldn't.You know. Directly diagnosed what it was he was, you know. His back pain he gave me some oxy and muscle. Relaxes and ibuprofen and that was the end of it, OK. I don't know, it's a little bit younger, so I bounce back. A little bit better. I mean, it's always hurt me depending on how. Walk us down. But then when I was. Risking those beverages a few years ago, that's when. Like I felt like I got hurt the first time I did the same exact thing and I was all my. And I was picking up this thing. You're gonna just freak.And that stuff down to the. Floor and the craft to that OK to the manager's office and then. In the years in between, did you have back pain? At all, Yes. OK. Can you tell me a little bit about that just so I can? Make sure that that's discussed. Now it's been the same since I entered it if I'm careful. How I stand and I put pressure on my left leg, make sure that I'm lifting. With my left leg too, and not only my right leg, then I could do. Fine and it's OK, but.Fitting. Standing and sitting, like getting on and off the toilet. That hurt. I have to be careful how I'm get up I listing. I have to be careful how I lift, make sure I lift absolutely properly. On my left leg, I can't stand for too long. On my right and I can't fit for too long so. It's kind of been that way since it since it got hurt and. Had already changed. What about sorry, I guess I mean in between 2000. Three in 2021. In those years between before. The second injury that was kind of like a like I was planning, it was kind of the same thing. It just, it didn't get really, really bad until after the 2021 injury, but it was. Still, like I said, I was getting up. See now carrying. Thing walking with my rucksack doing BT. Doing all that stuff was still hurting me. I got out and. 2005 so it wasn't that much longer after but. During that time of, like I said, the injury or the way that it was. It was the same way. Do you know at all if you ended up seeing? Umm, anybody about the back in particular? Service.Just my peer that's. Time and then the follow up.Wasn't an actual. Either it was after we got back and then I saw my. Woman, he was a Colonel, but my he was a doctor too, and he just kind of gave me. Some you know, some tips and.Umm, also. For my pain medication and it was the end of it, but they didn't, you know, no real. Work up. Done, did you? How do you think you use pain medications affected you? We got helped at that time, but then again. And you know, like I said, at that time I didn't have a problem with.You know. Dependency or anything like that, that's all gotcha, you know, do you think? A little bit different, do you? When did the issues with dependency come around? After I got out of the army and got my divorce and I started drinking. Gotcha.Well. Umm, I'm more than happy to write a letter for you. Umm, I'll do. My best to see if I can find any, you know, whatever minimal documentation. Patient they may have from that those time that time period for you too. OK, the and then also he just wanted me to also. Try to see if I could get something from the neural. That I saw or I don't know if he was the nerf guy or if he was actually. Actually a pain specialist, but if you could find that documentation and. Add it, That'd be great. OK.You'll want to make sure. You let me make sure that you've got the you'll you're going to. The original Metacritic as well. Umm, let me see if. I can find the name of the uh.Position. He would have seen. And they're going to be requesting documents for you too. Yes, that's the. Good. OK, OK.All right, Yeah. I'll make sure to just write a letter for you then. And you want me to mail it to you? Umm, yes. That would be the best thing and I'll just forward it to the. A lawyer.Yeah, that'd be great. Doctor Hardy, thank you so much. And that. Along with ibuprofen is all I needed. OK no problem, you doing OK? Otherwise.Yes Sir, I am. I'm actually at work. On the first day starting as an RT again. Oh that's fantastic. Wishing you luck. Thank you, Doctor. I appreciate all your help, Sir. Of course. All right. Will you focus on that? I'll focus on this for you, OK.Yes, Sir. Thank you. You're welcome. Take care. Bye bye.", "draftNote": "IDENTIFICATION  \nRashawn Hayes is a 41-year-old man with a history of chronic back pain following a service-related injury in 2003 and a subsequent exacerbation in 2021.  \n\nCHIEF COMPLAINT  \nChronic back pain.  \n\nSUBJECTIVE  \nThe patient reports a history of back pain that began in 2003 following an IED explosion during military service. He sustained the injury while carrying a fellow service member using a fireman’s carry, which caused him to strain his back. He recalls being evaluated by a PA at the time, who performed an X-ray, prescribed oxycodone, muscle relaxants, and ibuprofen, but no formal documentation or detailed workup was completed. The patient states that he was younger at the time and able to recover more quickly, though the pain persisted intermittently.  \n\nBetween 2003 and 2021, the patient describes ongoing back pain, particularly with activities such as standing, sitting, lifting, and transitioning from sitting to standing. He adapted by favoring his left leg and being cautious with lifting techniques. He notes that the pain was manageable but consistently present during this period.  \n\nIn 2021, the patient experienced a significant exacerbation of his back pain while lifting beverages at work. He describes the pain as similar to the initial injury, with an acute onset that caused him to drop to the floor. Since then, he reports chronic pain that affects his ability to stand or sit for prolonged periods, lift objects, or perform certain activities of daily living, such as getting on and off the toilet. He continues to favor his left leg to minimize discomfort.  \n\nThe patient mentions prior evaluations by a military physician and a possible neurologist or pain specialist, though he is uncertain about the specifics of these encounters. He requests assistance in obtaining any available documentation from these evaluations to support his case.  \n\nThe patient also briefly discussed a history of dependency on pain medications, which he attributes to events following his military discharge and divorce. He states that he does not currently have issues with dependency.  \n\nHABITS  \nNot discussed.  \n\nPAST MEDICAL/SURGICAL HISTORY  \nNot discussed.  \n\nSOCIAL HISTORY  \nThe patient served in the military and was discharged in 2005. He is currently employed and mentioned starting a new job as a respiratory therapist.  \n\nFAMILY HISTORY  \nNot discussed.  \n\nPHYSICAL EXAM  \n| Date       | Type   | Value | Unit       |  \n|------------|--------|-------|------------|  \n| 2025-09-22 | BP     | 122/74 | mmHg       |  \n| 2025-09-22 | HR     | 74    | bpm        |  \n| 2025-09-22 | Pulse  | 74    | bpm        |  \n| 2025-09-22 | RR     | 16    | breaths/min |  \n| 2025-09-22 | SpO2   | 96    | %          |  \n| 2025-09-22 | Temp   | 97    | F          |  \n| 2025-09-22 | Weight | 278.8 | lbs        |  \n| 2025-09-22 | BMI    | 35.39 |            |  \n| 2024-12-09 | Height | 74.5  | in         |  \n\nNo additional physical exam findings were discussed.  \n\nDIAGNOSTICS  \nNo diagnostics were discussed.  \n\nASSESSMENT AND PLAN  \n1. Chronic back pain: Persistent pain following a service-related injury in 2003, with exacerbation in 2021.  \n   - Write a letter summarizing the patient’s history and assist in obtaining documentation from prior evaluations.  \n   - Provide ibuprofen as requested.  \n\nRETURN TO CLINIC  \nNot discussed.  \n\n> This clinical documentation was assisted using an AI scribe. The patient was informed of the presence of a listening and transcribing tool during the visit and given the option to opt out and agreed to proceed. All efforts have been made to ensure the accuracy and confidentiality of the information captured.", "patientInstructions": "", "to_dos": [], "heyOmarQueries": []}}